Тестовая_база_ERP_14/src/Enums/ВидыЭлементовФинансовогоОтчета/ВидыЭлементовФинансовогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭлементовФинансовогоОтчета</name>
  <enumValues>
    <name>ЗаголовокОтчета</name>
  </enumValues>
  <enumValues>
    <name>НередактируемыйТекст</name>
  </enumValues>
  <enumValues>
    <name>РедактируемыйТекст</name>
  </enumValues>
  <enumValues>
    <name>МонетарныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>НемонетарныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>СтатьяБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ВсеСтатьиБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ПоказательБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ВсеПоказателиБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ПроизводныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>НефинансовыйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>РедактируемоеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаПоказателиВСтроках</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаПоказателиВКолонках</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаСложная</name>
  </enumValues>
  <enumValues>
    <name>ЭлементТаблицы</name>
  </enumValues>
  <enumValues>
    <name>Колонки</name>
  </enumValues>
  <enumValues>
    <name>Строки</name>
  </enumValues>
  <enumValues>
    <name>НастройкаЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаТаблицы</name>
  </enumValues>
  <enumValues>
    <name>Измерение</name>
  </enumValues>
  <enumValues>
    <name>Группа</name>
  </enumValues>
  <enumValues>
    <name>ИтогПоГруппе</name>
  </enumValues>
  <enumValues>
    <name>ФормулаПоГруппе</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/ВидыЭлементовФинансовогоОтчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Кэширует перечисление в структуре.
//
// Возвращаемое значение:
// 	 Структура - все значения в структура
//		Ключ - Имя значение
//		Значение - Ссылка на значение перчисления.
//
Функция Кэш() Экспорт
	
	ЭтаСсылка = Перечисления.ВидыЭлементовФинансовогоОтчета;
	ЭтиМетаданные = Метаданные.Перечисления.ВидыЭлементовФинансовогоОтчета;
	Кэш = Новый Структура;
	Для Каждого Значение Из ЭтиМетаданные.ЗначенияПеречисления Цикл
		Кэш.Вставить(Значение.Имя,ЭтаСсылка[Значение.Имя]);
	КонецЦикла;
	Возврат Кэш;
	
КонецФункции

// Возвращает виды элементов, которые могут быть источниками периодов
//
// Возвращаемое значение:
//	Массив - элементы перечисления
//		* ПеречислениеСсылка.ВидыЭлементовФинансовогоОтчета
//
Функция ВидыЭлементовИсточниковПериодовГруппировок() Экспорт
	ВидыЭлементовИсточниковДанных = Новый Массив;
	
	ВидыЭлементовИсточниковДанных.Добавить(ВсеСтатьиБюджетов);
	ВидыЭлементовИсточниковДанных.Добавить(ВсеПоказателиБюджетов);
	ВидыЭлементовИсточниковДанных.Добавить(СтатьяБюджетов);
	ВидыЭлементовИсточниковДанных.Добавить(ПоказательБюджетов);
	
	Возврат ВидыЭлементовИсточниковДанных;
КонецФункции

// Возвращает виды элементов, которые могут быть источниками периодов
//
// Возвращаемое значение:
//	Массив - элементы перечисления
//		* ПеречислениеСсылка.ВидыЭлементовФинансовогоОтчета
//
Функция ВидыЭлементовИсточниковДанных() Экспорт
	ВидыЭлементовИсточниковДанных = ВидыЭлементовИсточниковПериодовГруппировок();
	
	ВидыЭлементовИсточниковДанных.Добавить(НефинансовыйПоказатель);
	ВидыЭлементовИсточниковДанных.Добавить(РедактируемоеЗначение);
	
	Возврат ВидыЭлементовИсточниковДанных;
КонецФункции

#КонецОбласти

#КонецЕсли
